In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],\
                 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],\
                'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],\
                'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. **Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [4]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [5]:
df['FlightNumber'][1]=10055
df['FlightNumber'][3]=10075

<ipython-input-5-27db6a89492f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1]=10055
<ipython-input-5-27db6a89492f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3]=10075

In [6]:
df['FlightNumber']=df['FlightNumber'].astype('int')

In [7]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

2.**The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [8]:
temp_df=pd.DataFrame()

In [9]:
From=[]
To=[]
for i in df['From_To']:
    f,t=i.split('_')[0],i.split('_')[1]
    From.append(f)
    To.append(t)

In [10]:
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [11]:
To

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [12]:
temp_df['From']=From
temp_df['To']=To

In [13]:
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

In [14]:
for i in range(len(temp_df['From'])):
    temp_df['From'][i]=temp_df['From'][i].capitalize()

In [15]:
for i in range(len(temp_df['To'])):
    temp_df['To'][i]=temp_df['To'][i].capitalize()

In [16]:
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [17]:
df.drop('From_To',axis=1,inplace=True)

In [18]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [19]:
df_1=pd.concat([df,temp_df],ignore_index=True,axis=1)

In [20]:
df_1.rename(columns={0:'FlightNumber',1:'RecentDelays',2:'Airline',3:'From',4:'To'},inplace=True)

In [21]:
df_1

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

**In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.**

**Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.**

In [22]:
delays=df['RecentDelays']

In [25]:
col1,col2,col3=[],[],[]
for i in range(len(delays)):
    if len(delays[i])==0:
        col1.append('NaN')
        col2.append('NaN')
        col3.append('NaN')
    elif len(delays[i])==1:
        col1.append(delays[i][0])
        col2.append('NaN')
        col3.append('NaN')
    elif len(delays[i])==2:
        col1.append(delays[i][0])
        col2.append(delays[i][1])
        col3.append('NaN')
    else:
        col1.append(delays[i][0])
        col2.append(delays[i][1])
        col3.append(delays[i][2])
delay_1=pd.Series(col1)
delay_2=pd.Series(col2)
delay_3=pd.Series(col3)

In [26]:
delay_1

0     23
1    NaN
2     24
3     13
4     67
dtype: object

In [28]:
df_1['delay_1']=delay_1
df_1['delay_2']=delay_2
df_1['delay_3']=delay_3

In [29]:
df_1

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,NaN

In [31]:
df_1.drop('RecentDelays',axis=1,inplace=True)

In [32]:
df_1

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23,47,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67,32,NaN